In [1]:
import pandas as pd

In [2]:
df_exam = pd.read_excel('excel_exam.xlsx')  # 엑셀 파일을 불러와 df_exam에 할당
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [5]:
df_exam = pd.read_excel('c:/Users/shs21/Downloads/excel_exam.xlsx')

In [8]:
sum(df_exam['english']) / 20

84.9

In [7]:
sum(df_exam['science']) / 20

59.45

In [9]:
x = [1, 2, 3, 4, 5]
x

[1, 2, 3, 4, 5]

In [10]:
len(x)

5

In [11]:
df = pd.DataFrame({'a' : [1, 2, 3],
                   'b' : [4, 5, 6]})
df

   a  b
0  1  4
1  2  5
2  3  6

In [12]:
len(df)

3

In [13]:
len(df_exam)

20

In [14]:
sum(df_exam['english']) / len(df_exam)

84.9

In [15]:
sum(df_exam['science']) / len(df_exam)

59.45

In [17]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx')
df_exam_novar
# 엑셀 파일 첫 행이 변수명이 아닐 때 : 첫 번째 행을 변수명으로 인식하는 문제 발생

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45
5  7    4  46  98    65
6  8    4  48  87    12

In [18]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12

In [22]:
# Sheet1 시트의 데이터 불러오기
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 'Sheet1')

# 첫 번째 시트의 데이터 불러오기
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 0)